client/results/rq2/h1/stresstest/client_64/summary.txt
starting benchmark...
spawning thread #0: 32 total client(s). 25000 total requests
spawning thread #1: 32 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 11.93s, 4189.99 req/s, 18.37MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      600us     71.52ms     14.54ms      6.11ms    74.25%
time for connect:    16.34ms     65.67ms     40.98ms     10.91ms    75.00%
time to 1st byte:    43.04ms    101.55ms     68.96ms     15.65ms    71.88%
req/s           :      65.45       73.84       68.61        2.79    51.56%